# CannotComputeProperArea Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SiteFailures..::..CannotComputeProperArea Property
BuiltInFailures..::..SiteFailures Class See Also
---
Property Lines must close. Area will not be computed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotComputeProperArea { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotComputeProperArea As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotComputeProperArea {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SiteFailures Class
Autodesk.Revit.DB Namespace